Show / Hide Table of Contents
Enum TypeEdgePosition
Type edge position
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum TypeEdgePosition
Fields
 Name |  Description
 PartEdge
part of the edge, mereno od pocatku hrany nebo podle zadani v jinem properties
 PartEdgeFromEnd
on part of edge measured from end of the edge
 PartEdgeToEndEdge
parts of the edge to end edge - pouze na vybranem vlasniku - napriklad u linioveho zatizeni na hrane
 PartEdgeToSegment
parts on edge, protazene az k segmentu nebo k poslenimu pruseciku s vnejsim obrysem - napriklad u vyztuze
 WholeLength
whole length
 Improve this Doc
 View Source